       IDENTIFICATION DIVISION.
       PROGRAM-ID. Comment.
       
       *> This is a comment in COBOL.
       PROCEDURE DIVISION.
           DISPLAY 'Hello, World!'. *> This is a inline comment
       STOP RUN.
