       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO_WORLD.
       
       PROCEDURE DIVISION.
           DISPLAY 'HELLO, WORLD!'.
       STOP RUN.
